OpenFOAM v.7/Tutorial (OF Simulation Setup)/0/H2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    H2inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    Airinlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           $internalField;
    }
    bottom
    {
        type            symmetryPlane;
    }
    reservoirWall
    {
        type            zeroGradient;
    }
    Obstacle
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
