OpenFOAM v.7/Tutorial (OF Simulation Setup)/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            noSlip;
    }

    H2inlet
    {
	type		pressureDirectedInletVelocity;
	phi		phi;
	rho		rho;
	inletDirection  uniform (1 0 0);
	value		$internalField;
    }

    Airinlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    bottom
    {
        type            symmetryPlane;
    }

    reservoirWall
    {
        type            noSlip;
    }

    Obstacle
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}
// ************************************************************************* //
