OpenFOAM v.7/Tutorial (OF Simulation Setup)/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }

    H2inlet
    {
        type            calculated;
        value           uniform 0;
    }

    Airinlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    bottom
    {
        type            symmetryPlane;
    }

    reservoirWall
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    
    Obstacle
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
