OpenFOAM v.7/Tutorial (OF Simulation Setup)/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    top
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }

    H2inlet
    {
        type            zeroGradient;
    }

    Airinlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            symmetryPlane;
    }

    reservoirWall
    {
        type            kqRWallFunction;
        value           uniform 254.217;
    }

    Obstacle 
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    
    frontAndBack
    {
        type            empty;
    }  

}

// ************************************************************************* //
