OpenFOAM v.7/Tutorial (OF Simulation Setup)/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    H2inlet
    {
        type            calculated;
        value           uniform 0;
    }

    Airinlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    bottom
    {
        type            symmetryPlane;
    }

    reservoirWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Obstacle
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
                
    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
