OpenFOAM v.7/Tutorial (OF Simulation Setup)/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    top
    {
        type            omegaWallFunction;
        value           uniform 0.1;
        Cmu		0.09;
        kappa		0.41;
        E		9.8;
    }

    H2inlet
    {
        type            zeroGradient;
    }

    Airinlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            symmetryPlane;
    }

    reservoirWall
    {
        type            omegaWallFunction;
        value           uniform 9.703e03;
        Cmu		0.09;
        kappa		0.41;
        E		9.8;
    }

    Obstacle
    {
        type            omegaWallFunction;
        value           uniform 0.1;
        Cmu		0.09;
        kappa		0.41;
        E		9.8;
    }
        
    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
