OpenFOAM v.7/Tutorial (OF Simulation Setup)/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e05;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    H2inlet
    {
        type            fixedValue;
        value           uniform 700e05;
    }
    Airinlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 1e05;
        value           $internalField;
    }
    outlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 1e05;
        value           $internalField;
    }
    bottom
    {
        type            symmetryPlane;
    }
    reservoirWall
    {
        type            zeroGradient;
    }
    Obstacle
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
