OpenFOAM v.7/Tutorial (OF Simulation Setup)/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
// 				SETUP
// Chemkin format uses these units:
// 	mol, cm^3, s, K; cal
// OpenFOAM native format uses:
// 	kmol, m^3, s, K; K
// The native format is what this file is using. 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
elements        
3
(
    O
    H
    N
);

species
3
(
    O2
    H2
    N2
);

reactions
{
}


// ************************************************************************* //
