OpenFOAM v.7/Tutorial (OF Simulation Setup)/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.0001;

vertices
(
	(0 0 0)		//0
	(7500 0 0)	//1
	(7900 0 0)	//2
	(7905 0 0)	//3
	(15000 0 0)	//4
	(0 15 0)	//5
	(7500 15 0)	//6
	(7900 15 0)	//7
	(0 20 0)	//8
	(7500 20 0)	//9
	(7900 20 0)	//10
	(7500 250 0)	//11
	(7900 250 0)	//12
	(7905 250 0)	//13
	(0 500 0)	//14
	(7500 500 0)	//15
	(7900 500 0)	//16
	(7905 500 0)	//17
	(15000 500 0)	//18

	(0 0 23.561944902)	//19
	(7500 0 23.561944902)	//20
	(7900 0 23.561944902)	//21
	(7905 0 23.561944902)	//22
	(15000 0 23.561944902)	//23
	(0 15 23.561944902)	//24
	(7500 15 23.561944902)	//25
	(7900 15 23.561944902)	//26
	(0 20 23.561944902)	//27
	(7500 20 23.561944902)	//28
	(7900 20 23.561944902)	//29
	(7500 250 23.561944902)	//30
	(7900 250 23.561944902)	//31
	(7905 250 23.561944902)	//32
	(0 500 23.561944902)	//33
	(7500 500 23.561944902)	//34
	(7900 500 23.561944902)	//35
	(7905 500 23.561944902)	//36
	(15000 500 23.561944902)//37

	(15000 250 0)	//38
	(0 250 0)	//39

	(15000 250 23.561944902)//40
	(0 250 23.561944902)	//41

);

blocks
(
    hex (0 1 6 5 19 20 25 24) (7500 15 1) simpleGrading (1 1 1)
    hex (1 2 7 6 20 21 26 25) (400 15 1) simpleGrading (1 1 1)
    hex (6 7 10 9 25 26 29 28) (400 5 1) simpleGrading (1 1 1)
    hex (8 9 11 39 27 28 30 41) (4700 230 1) simpleGrading (0.625 1 1)
    hex (9 10 12 11 28 29 31 30) (400 230 1) simpleGrading (1 1 1)
    hex (39 11 15 14 41 30 34 33) (4700 250 1) simpleGrading (0.625 1 1)
    hex (11 12 16 15 30 31 35 34) (400 250 1) simpleGrading (1 1 1)
    hex (12 13 17 16 31 32 36 35) (5 250 1) simpleGrading (1 1 1)
    hex (3 4 38 13 22 23 40 32) (4500 250 1) simpleGrading (1.6 1 1)
    hex (13 38 18 17 32 40 37 36) (4500 250 1) simpleGrading (1.6 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (14 33 34 15)
            (15 34 35 16)
            (16 35 36 17)
            (17 36 37 18)		
        );
    }

    H2inlet
    {
        type patch;
        faces
        (
            (0 19 24 5)
        );
    }

    Airinlet
    {
        type patch;
        faces
        (
            (8 27 41 39)
	    (39 41 33 14)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 38 40 23)
            (38 18 37 40)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 20 19)
            (1 2 21 20)
            (3 4 23 22)
        );
    }

    reservoirWall
    {
        type wall;
        faces
        (
            (6 5 24 25)
            (9 6 25 28)
            (8 9 28 27)
        );
    }

    Obstacle
    {
        type wall;
        faces
        (
            (2 7 26 21)
            (7 10 29 26)
            (10 12 31 29)
	    (12 13 32 31)
	    (13 3 22 32)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 5 6 1)
            (1 6 7 2)
            (6 9 10 7)
            (8 39 11 9)
            (9 11 12 10)
            (39 14 15 11)
            (11 15 16 12)
            (12 16 17 13)
            (3 13 38 4)
            (13 17 18 38)

            (19 20 25 24)
            (20 21 26 25)
            (25 26 29 28)
            (27 28 30 41)
            (28 29 31 30)
            (41 30 34 33)
            (30 31 35 34)
            (31 32 36 35)
            (22 23 40 32)
            (32 40 37 36)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
