OpenFOAM v.7/Tutorial (OF Simulation Setup)/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoReactingCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1e-03;

deltaT          1e-09;

writeControl    adjustableRunTime;

writeInterval   5e-07;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable true;

adjustTimeStep  yes;

useAcousticCourant yes;

maxCo           0.1;

maxDeltaT       1e-06;

maxAcousticCo	0.1;

functions
{
	#includeFunc residuals
	#includeFunc minMaxMagnitude
}


// ************************************************************************* //
