OpenFOAM v.7/Tutorial (OF Simulation Setup)/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho.*)"
    {
        solver          diagonal;
    }

    U
    {
	solver		PBiCGStab;
	preconditioner	DIC;
	tolerance	1e-15;
	relTol		0;
    }

    "(k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
    }

    "(k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }

    h
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }

    e
    {
	$U;
        tolerance       1e-10;
        relTol          0;
    }

    "(O2|H2|H2O|N2|Yi)"
    {
	solver          PBiCGStab;
        preconditioner	DILU;
        tolerance       1e-10;
        relTol          0;
    }
}

CENTRAL
{
}

relaxationFactors
{
    equations
    {
        ".*"            0.3;
    }
}


// ************************************************************************* //
