OpenFOAM v.7/Tutorial (OF Simulation Setup)/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 291
    volScalarFieldValue p 1e05
    volScalarFieldValue H2 0
    volScalarFieldValue N2 0.79
    volScalarFieldValue O2 0.21
);

regions
(
    boxToCell
    {
        box (0 0 0) (0.75 0.0015 0.0023561944902);
        fieldValues
        (
	    volScalarFieldValue T  291
	    volScalarFieldValue p  700e05
            volScalarFieldValue H2 1
            volScalarFieldValue N2 0
            volScalarFieldValue O2 0
        );
    }
);


// ************************************************************************* //
